Repository: jazzband/django-rest-framework-simplejwt
Catalog: rest_framework_simplejwt/locale/*/LC_MESSAGES/django.po
Languages: ar

source: Authorization header must contain two space-delimited values
ar: الـ header الخاص بالمصادقة يجب أن يحتوي على قيمتين بينهما مسافة

source: Given token not valid for any token type
ar: الرمز المعطى ليس لديه نوع صالح

source: Token contained no recognizable user identification
ar: هذا الرمز لا يحتوي على معلومات تعرف المستخدم

source: User not found
ar: لم يتم العثور على المستخدم

source: User is inactive
ar: المستخدم غير فعال

source: Unrecognized algorithm type '{}'
ar: لم يتم التعرف على نوع الخوارزمية '{}'

source: You must have cryptography installed to use {}.
ar: يجب عليك تنزيل مكتبة cryptography من أجل استخدام {}.

source: Unrecognized type '{}', 'leeway' must be of type int, float or timedelta.
ar: نوع '{}' غير متعرف عليه 'leeway' يجب أن يكون int, float أو timedelta.

source: Token is invalid or expired
ar: هذا الرمز غير صالح أو منتهي الصلاحية

source: Invalid algorithm specified
ar: الخوارزمية المختارة غير صالحة

source: No active account found with the given credentials
ar: لم يتم العثور على مسنخدم بالمعلومات المعطاة

source: The '{}' setting has been removed. Please refer to '{}' for available settings.
ar: تم حذف الخيار '{}'. الرجاء التأكد من الخيارات المتاحة لدى '{}'.

source: user
ar: مستخدم

source: created at
ar: أنشأت بتاريخ

source: expires at
ar: انتهت صلاحيتها بتاريخ

source: Token Blacklist
ar: اللائحة السوداء للرموز

source: Cannot create token with no type or lifetime
ar: لا يمكن إنشاء رمز بدون نوع او حياة

source: Token has no id
ar: هذا رمز لا يحتوي على id

source: Token has no type
ar: هذا رمز ليس لديه نوع

source: Token has wrong type
ar: هذا رمز لديه نوع خاطئ

source: Token has no '{}' claim
ar: هذا الرمز ليس لديه '{}'

source: Token '{}' claim has expired
ar: '{}' المتعلقة بالرمز قد انتهت صلاحيتها

source: Token is blacklisted
ar: هذا الرمز تم نقله إلى اللائحة السوداء
